{
    "IDEFICS":{
        "simple": "User: Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give one of the 4 images as the target. You should communicate the target to the listener in a message that distinguishes the target from other images. Two different images should not have the same message at any point. The listener will try to guess which image is the target based on your message. You will know which image the listener guesses and can decide whether to adjust your message for this image next time.\n\nYour reply should only contain the message and be shorter than 20 words. Do not mention any image's label (A, B, C, D) in your message.",
        "gricean_hint": "User: Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give one of the 4 images as the target. You should communicate the target to the listener in a message that distinguishes the target from other images. Two different images should not have the same message at any point. The listener will try to guess which image is the target based on your message. You will know which image the listener guesses and can decide whether to adjust your message for this image next time.\n\nYour reply should only contain the message and be shorter than 20 words. Do not mention any image's label (A, B, C, D) in your message. Your message should contain enough information for the listener to choose the target correctly. However, every token you generate has a cost. A longer message costs more reading time for the listener, so it’s not ideal if a shorter message is enough. Think about how the amount of information needed may change as more rounds are played and based on the listener's performance in previous rounds.",
        "explicit": "User: Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give one of the 4 images as the target. You should communicate the target to the listener in a message that distinguishes the target from other images. Two different images should not have the same message at any point. The listener will try to guess which image is the target based on your message. You will know which image the listener guesses and can decide whether to adjust your message for this image next time.\n\nYour reply should only contain the message and be shorter than 20 words. Do not mention any image's label (A, B, C, D) in your message. Start with more detailed messages to ensure the listener's accuracy. As more rounds are completed and as the listener understands you better, gradually condense your messages, making them shorter and shorter every round.",
        "explicit_consistency": "User: Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give one of the 4 images as the target. You should communicate the target to the listener in a message that distinguishes the target from other images. Two different images should not have the same message at any point. The listener will try to guess which image is the target based on your message. You will know which image the listener guesses and can decide whether to adjust your message for this image next time.\n\nYour reply should only contain the message and be shorter than 20 words. Do not mention any image's label (A, B, C, D) in your message. Start with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round. When creating a shorter message for an image, try to extract salient tokens from the previous messages for this image rather than introducing new words. The short messages should still allow the listener to choose the target correctly. For each image, when you reach a message you think can not be further shortened without hurting the listener's accuracy, you should keep using that message for the rest of the game."
    },

    "llava":{
        "simple": "Play a game with me and a third player (the listener). This game consists of multiple rounds in which you interact with me and a listener on the same collage of 4 images. In each round, I will refer to one of the images as the target, by saying their location in the collage. You should generate a message to communicate the target to the listener without mentioning this location. The listener will then guess the target. I will tell you which image the listener guessed so you may adjust your message based on the listener's performance.\n\nFocus on the content of the images, not their locations in the collage. In other words, don't include phrases like top left, top right, bottom left, bottom right in your message. Keep each message under 20 words. Your reply should only contain your message.",
        "gricean_hint":"Play a game with me and a third player (the listener). This game consists of multiple rounds in which you interact with me and a listener on the same collage of 4 images. In each round, I will refer to one of the images as the target, by saying their location in the collage. You should generate a message to communicate the target to the listener without mentioning this location. The listener will then guess the target. I will tell you which image the listener guessed so you may adjust your message based on the listener's performance.\n\nYour message should contain enough information for the listener to guess correctly. However, every token you generate has a cost. A longer message costs more reading time for the listener, so it’s not ideal if a shorter message is enough. Think about how the amount of information needed may change as more rounds are played and based on the listener's performance in previous rounds.\n\nFocus on the content of the images, not their locations in the collage. In other words, don't include phrases like top left, top right, bottom left, bottom right in your message. Keep each message under 20 words. Your reply should only contain your message.",
        "explicit": "Play a game with me and a third player (the listener). This game consists of multiple rounds in which you interact with me and a listener on the same collage of 4 images. In each round, I will refer to one of the images as the target, by saying their location in the collage. You should generate a message to communicate the target to the listener without mentioning this location. The listener will then guess the target. I will tell you which image the listener guessed so you may adjust your message based on the listener's performance.\n\nStart with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round.\n\nFocus on the content of the images, not their locations in the collage. In other words, don't include phrases like top left, top right, bottom left, bottom right in your message. Keep each message under 20 words. Your reply should only contain your message.",
        "explicit_consistency": "Play a game with me and a third player (the listener). This game consists of multiple rounds in which you interact with me and a listener on the same collage of 4 images. In each round, I will refer to one of the images as the target, by saying their location in the collage. You should generate a message to communicate the target to the listener without mentioning this location. The listener will then guess the target. I will tell you which image the listener guessed so you may adjust your message based on the listener's performance.\n\nStart with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round. When creating a shorter message for an image, try to extract salient tokens from the previous messages for this image rather than introducing new words. The short messages should still allow the listener to choose the target correctly. For each image, when you reach a message you think can not be further shortened without hurting the listener's accuracy, you should keep using that message for the rest of the game.\n\nFocus on the content of the images, not their locations in the collage. In other words, don't include phrases like top left, top right, bottom left, bottom right in your message. Keep each message under 20 words. Your reply should only contain your message."
    },
    
    
    "GPT": {
        "simple" :"Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses, so you may adjust your message based on the listener's accuracy. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence.",
        "gricean_hint" :"Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses, so you may adjust your message based on the listener's accuracy. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. Your message should contain enough information for the listener to choose the target correctly. However, every token you generate has a cost. A longer message costs more reading time for the listener, so it’s not ideal if a shorter message is enough. Think about how the amount of information needed may change as more rounds are played and based on the listener's performance in previous rounds.",
        "explicit": "Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. Start with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round.", 
        "explicit_consistency": "Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. Start with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round. When creating a shorter message for an image, try to extract salient tokens from the previous messages for this image rather than introducing new words. The short messages should still allow the listener to choose the target correctly. For each image, when you reach a message you think can not be further shortened without hurting the listener's accuracy, you should keep using that message for the rest of the game."
    },
    
    "Gemini": {
        "simple": "system: Play a game with a listener. This game consists of multiple rounds and 4 images (labeled A, B, C, D). You will act as the speaker in this game. In each round, one of the images is given as the target. You will generate a message to tell the listener which image is the target without mentioning any image label or explicitly referring to the previous rounds. The listener will try to choose the target correctly based on your message. You will know which image the listener chooses so you may adjust your message based on the listener's performance.\n\nAll messages must be below 20 words. Each message should not exceed one sentence and it does not need to be a full sentence. Make sure your message distinguishes the target from other images.\n\nReply with your message only and in English only. Do not generate any words that are not part of your message. Do not mention any image labels (A, B, C, D). Do not mention previous rounds in the message.",
        "gricean_hint": "system: Play a game with a listener. This game consists of multiple rounds and 4 images (labeled A, B, C, D). You will act as the speaker in this game. In each round, one of the images is given as the target. You will generate a message to tell the listener which image is the target without mentioning any image label or explicitly referring to the previous rounds. The listener will try to choose the target correctly based on your message. You will know which image the listener chooses so you may adjust your message based on the listener's performance.\n\nAll messages must be below 20 words. Each message should not exceed one sentence and it does not need to be a full sentence. Make sure your message distinguishes the target from other images. Your message should contain enough information for the listener to guess correctly. However, every token you generate has a cost. A longer message costs more reading time for the listener, so it’s not ideal if a shorter message is enough. Think about how the amount of information needed may change based on the listener's performance in previous rounds and as more rounds are played.\n\nReply with your message only and in English only. Do not generate any words that are not part of your message. Do not mention any image labels (A, B, C, D). Do not mention previous rounds in the message.",
        "explicit": "system: Play a game with a listener. This game consists of multiple rounds and 4 images (labeled A, B, C, D). You will act as the speaker in this game. In each round, one of the images is given as the target. You will generate a message to tell the listener which image is the target without mentioning any image label or explicitly referring to the previous rounds. The listener will try to choose the target correctly based on your message. You will know which image the listener chooses so you may adjust your message based on the listener's performance.\n\nAll messages must be below 20 words. Each message should not exceed one sentence and it does not need to be a full sentence. Make sure your message distinguishes the target from other images. Start with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round.\n\nReply with your message only and in English only. Do not generate any words that are not part of your message. Do not mention any image labels (A, B, C, D). Do not mention previous rounds in the message.",
        "explicit_consistency": "system: Play a game with a listener. This game consists of multiple rounds and 4 images (labeled A, B, C, D). You will act as the speaker in this game. In each round, one of the images is given as the target. You will generate a message to tell the listener which image is the target without mentioning any image label or explicitly referring to the previous rounds. The listener will try to choose the target correctly based on your message. You will know which image the listener chooses so you may adjust your message based on the listener's performance.\n\nAll messages must be below 20 words. Each message should not exceed one sentence and it does not need to be a full sentence. Make sure your message distinguishes the target from other images. Your reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. Start with more detailed messages to ensure the listener's accuracy. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round. When creating a shorter message for an image, try to extract salient tokens from the previous messages for this image rather than introducing new words. The short messages should still allow the listener to choose the target correctly. For each image, when you reach a message you think can not be further shortened without hurting the listener's accuracy, you should keep using that message for the rest of the game.\n\nReply with your message only and in English only. Do not generate any words that are not part of your message. Do not mention any image labels (A, B, C, D). Do not mention previous rounds in the message."
    },
    "Claude": {
        "simple" :"Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses, so you may adjust your message based on the listener's accuracy. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence.\n",
        "gricean_hint" :"Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses, so you may adjust your message based on the listener's accuracy. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. Your message should contain enough information for the listener to choose the target correctly. However, every token you generate has a cost. A longer message costs more reading time for the listener, so it’s not ideal if a shorter message is enough. Think about how the amount of information needed may change as more rounds are played and based on the listener's performance in previous rounds.\n",
        "explicit": "Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round.\n", 
        "explicit_consistency": "Play a repeated reference game with me and a third player (the listener). You will act as the speaker in the game. This game consists of multiple rounds in which the speaker interacts with me and the listener on the same referential context (4 images). In each round, I give you one of the 4 images as the target. You should communicate the target to the listener in a message. The listener will try to choose the target correctly based on your message. I will tell you which image the listener chooses. The listener will see the 4 images in a different order every round so you cannot communicate the target simply by using its position or label (A, B, C, D).\n\nYour reply should only contain the message and the message should always be shorter than 20 words. Throughout, your message should not exceed one sentence but it does not need to be a full sentence. As more rounds are completed and the listener understands you better, gradually condense your messages, making them shorter and shorter every round. When creating a shorter message for an image, try to extract salient tokens from the previous messages for this image rather than introducing new words. The short messages should still allow the listener to choose the target correctly. For each image, when you reach a message that can not be further shortened, you should keep using that message for the rest of the game.\n"
    }
    
}